<?php

///////////////////////////////////////////////////////////////////////////////
//                                                                           //
//   Простой онлайн блокнот "Wikipad" // Вход в систему                      //
//   ----------------------------------------------------------------------  //
//   Copyright (C) 1998-2021 Studio "Cherry-Design"                          //
//   URL: https://www.cherry-design.ru/                                      //
//   E-mail: mike@cherry-design.ru                                           //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////

// Имя данного скрипта
$this_script = "logout.php";

// Производим инициализацию
require("includes/initialization.php"); 

// Если пользователь не авторизован, то делаем редирект на первую страницу
if (!$globals["user_entry_flag"]) {
    header("Location: ./");
}

///////////////////////////////////////////////////////////////////////////////
//                                                                           //
//            Функция обеспечивающая выход пользователя из системы           //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////

function logout_user() {

    // Удаляем логин и пароль пользователя из Cookies
    setcookie("user_login", "");
    setcookie("user_password", "");
}

///////////////////////////////////////////////////////////////////////////////

// Обеспечиваем выход пользователя
logout_user();

// Перенаправляем пользователя на страницу с которой он пришел
header("Location: ".get_referer_link());

?>